app/views/users/show.html.erb


    <h3>Posts (<%= @user.microposts.published.count %>)</h3>
    <% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]