app/controllers/comments_controller.rb

  def create
    @comment = @micropost.comments.create(comment_params.merge(user: current_user))
---
INSERT INTO "comments" ("body", "user_id", "micropost_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "forman@gmail.com"], ["user_id", 12], ["micropost_id", 15], ["created_at", "2018-12-02 23:38:07.081150"], ["updated_at", "2018-12-02 23:38:07.081150"]]

  def find_micropost
    @micropost = Micropost.find(params[:micropost_id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]