app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @comments = @micropost.comments
    @micropost.increment!(:views_count)
    # @post_comments = @post.comments.order(created_at: :asc).paginate(page: params[:page], per_page: 10)
     @micropost_comments = @micropost.comments.paginate(page: params[:page], per_page: 10).select { |comment| comment.parent_id.nil? }
---
UPDATE "microposts" SET "title" = $1, "content" = $2, "link" = $3, "updated_at" = $4 WHERE "microposts"."id" = $5  [["title", "Test"], ["content", "<div>Tested_post</div>"], ["link", "https://www.youtube.com/watch?v=_zkL6AVrHLQ"], ["updated_at", "2018-12-05 21:12:50.840226"], ["id", 23]]
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = $1  [["micropost_id", 3]]

  def update
    if @micropost.update!(micropost_params)
---
UPDATE "microposts" SET "title" = $1, "content" = $2, "link" = $3, "updated_at" = $4 WHERE "microposts"."id" = $5  [["title", "Test"], ["content", "<div>Tested_post</div>"], ["link", "https://www.youtube.com/watch?v=_zkL6AVrHLQ"], ["updated_at", "2018-12-05 21:12:50.840226"], ["id", 23]]

    def set_params
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]

    def correct_user
      @micropost = current_user.microposts.find_by(id: params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1 AND "microposts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 41], ["LIMIT", 1]]