app/controllers/pictures_controller.rb

  def create #create new image and save to server(url)
    @picture = Picture.new(image_params)
    @picture.save
---
INSERT INTO "pictures" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "Screenshot_from_2018-11-09_22-40-34.png"], ["created_at", "2018-12-04 13:29:58.065912"], ["updated_at", "2018-12-04 13:29:58.065912"]]

  def destroy
    picture = Picture.find(params[:id])
    picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 3]]