app/controllers/users_controller.rb

  def show
    @microposts = @user.microposts.desc
    @microposts = @microposts.public_send(params[:sorting]) if params[:sorting].present?
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def toggle_banned
    @user.toggle!(:banned)
---
UPDATE "users" SET "banned" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["banned", false], ["updated_at", "2018-12-05 19:24:01.078701"], ["id", 3]]

  def set_params
    @user  = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]